[Killed] BlockStatement
chapters/ch9killed/src/ch9.js:1:26
-function union_set(a, b) {
-    let result = new Set(a || []);
-    b?.forEach(function (bItem) {
-        //if (!result.has(bItem)) result.add(bItem);
-        result.add(bItem);
-    });
-    return result;
-}
+function union_set(a, b) {}
 
 module.exports = { union_set };
killedBy: ch1-4-d: union_set 測試結果為聯集Set
statusReason: TypeError: Cannot read properties of undefined (reading 'size')

[Killed] LogicalOperator
chapters/ch9killed/src/ch9.js:2:26
 function union_set(a, b) {
-    let result = new Set(a || []);
+    let result = new Set(a && []);
     b?.forEach(function (bItem) {
         //if (!result.has(bItem)) result.add(bItem);
killedBy: ch1-4-d: union_set 測試結果為聯集Set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 2

[Killed] BlockStatement
chapters/ch9killed/src/ch9.js:3:33
 function union_set(a, b) {
     let result = new Set(a || []);
-    b?.forEach(function (bItem) {
-        //if (!result.has(bItem)) result.add(bItem);
-        result.add(bItem);
-    });
+    b?.forEach(function (bItem) {});
     return result;
 }
killedBy: ch1-4-d: union_set 測試結果為聯集Set
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 3
